# 执行码农ETF分析
import etf_pe as etf_pe
# 数据准备
idx_dict = {
    ##Add By Laye
    ## 宽基指数
    '000985.XSHG': ['-', '-'],  # 中证全指
    '000300.XSHG': ['510300', '160706'],  # 沪深300
    '000905.XSHG': ['510500', '160119'],  # 中证500
    '000852.XSHG': ['512100', '004194'],  # 中证1000
    ##
    ## 大盘指数
    '000016.XSHG': ['510050', '-'],  # 上证50
    '000922.XSHG': ['-', '100032'],  # 中证红利
    ##
    ## 小盘指数
    '399006.XSHE': ['159915', '110026'],  # 创业板指
    '399005.XSHE': ['159902', '163111'],  # 中小板指
    ##
    ## 主题指数
    '399812.XSHE': ['-', '000968'],  # 中证养老
    '000933.XSHG': ['-', '001180'],  # 中证医药
    '000990.XSHG': ['159946', '001458'],  # 全指消费
    '000993.XSHG': ['159939', '002974'],  # 全指信息
    '399971.XSHE': ['512980', '-'],  # 中证传媒
    '000827.XSHG': ['512580', '001064'],  # 中证环保
    '399975.XSHE': ['512880', '-'],  # 证券公司
}

# 数据执行
manongETFAnalysis = etf_pe.ManongETFAnalysis()
manongETFAnalysis.update_hs_data(idx_dict)
(value_df, fund_df) = manongETFAnalysis.idx_analysis(idx_dict)
